local map={
{id=1.0,name="大地图",pic="地图.大地图",desc=[[ 有人的地方，就是江湖！ ]],
musics={ "音乐.逍遥", "音乐.逍遥1", "音乐.逍遥2", "音乐.逍遥3", "音乐.逍遥4", "音乐.天龙八部.佛音2", "音乐.天龙八部.佛音3",  },musicEffect="",},

{id=2.0,name="龙门镖局",pic="地图.龙门镖局",desc=[[ 你的眼前是威武雄壮的洛阳龙门镖局，此处人声鼎沸、熙熙攘攘，南来北往的商旅都来这里求保平安。
几个粗壮的镖头正斜倚在镖局门口，用怀疑的眼光上下打量你。 ]],
musics={ "音乐.倚天.醉拳",  },musicEffect="",},

{id=3.0,name="洛阳",pic="地图.洛阳",desc=[[ 你来到了繁华的东都洛阳，洛阳牡丹的美誉名动天下，才子佳人相会于此，无数传世佳作自洛阳问世。 ]],
musics={ "音乐.城市3",  },musicEffect="",},

{id=4.0,name="平一指居",pic="地图.室内",desc=[[ 杀人名医平一指坐诊洛阳已有多日，门庭若市。 ]],
musics={ "音乐.城市1",  },musicEffect="",},

{id=5.0,name="长安",pic="地图.长安",desc=[[ 你走进辉煌壮丽的帝都长安，高耸入云的城墙、金碧辉煌的斗拱、白玉无瑕的大道...长安以其磅礴雄浑的姿态迎接着各国来客。 ]],
musics={ "音乐.武侠进行",  },musicEffect="",},

{id=6.0,name="长安城中心",pic="地图.长安",desc=[[ 中央区是帝国官员、豪门的宅邸，天子脚下，无比恩宠。 ]],
musics={ "",  },musicEffect="",},

{id=7.0,name="长安城边",pic="地图.城市",desc=[[ 城东是下层百姓生活居所，此外处决朝廷重犯的菜市口亦设于此。 ]],
musics={ "",  },musicEffect="",},

{id=8.0,name="司马府",pic="地图.府门前",desc=[[ 你来到了长安行军司马府，在中央区的豪宅之中，司马府并不起眼。 ]],
musics={ "音乐.琵琶语",  },musicEffect="",},

{id=9.0,name="长安菜市口",pic="地图.城市",desc=[[ 你来到了处决重犯的菜市口，仿佛还可以听到鬼魂的哀鸣。 ]],
musics={ "",  },musicEffect="",},

{id=10.0,name="长安城郊",pic="地图.树林",desc=[[ 此处是山清水秀的长安城郊，风和日丽，鸟语花香。 ]],
musics={ "",  },musicEffect="",},

{id=11.0,name="鸣凤山庄",pic="地图.鸣凤山庄",desc=[[ 你的眼前忽然忽然开朗，在山水之间一座气势宏大的山庄面南而立。渭水的柔波里倒映着杨柳的身姿，鸟雀在山涧之间嬉戏争鸣，山庄正门口挂着的几个红灯笼在微风中轻轻摆动。 ]],
musics={ "音乐.中原树林",  },musicEffect="",},

{id=12.0,name="长安琴舍",pic="地图.琴舍",desc=[[ 此处是长安城中一处琴馆，在上流社交圈中很受欢迎。 ]],
musics={ "",  },musicEffect="",},

{id=13.0,name="长安西市",pic="地图.长安西市",desc=[[ 城西是热闹非凡的长安西市，各国商贾云集于此，各式奇珍异宝从这里沿着丝绸之路发向远方。 ]],
musics={ "音乐.武侠进行",  },musicEffect="",},

{id=14.0,name="长安酒楼",pic="地图.酒楼",desc=[[ 你来到了西市最热闹的一家酒楼，这是一家百年老店，老板人脉丰富，神通广大。 ]],
musics={ "音乐.武侠进行",  },musicEffect="",},

{id=15.0,name="衡阳",pic="地图.衡阳",desc=[[ 你沿着一条光亮的青石板路走进衡阳城，相较中原而言，南方的衡阳城人烟稀少，淅淅沥沥的细雨打在青石板上，颇有几分萧索的意味。
因为连日阴雨、行人稀少，茶肆的小二索性趴在桌上睡起觉来。 ]],
musics={ "音乐.武侠流水",  },musicEffect="",},

{id=16.0,name="衡阳琴舍",pic="地图.琴舍",desc=[[ 你来到了衡阳城中的一处琴馆，潇湘水云之声不绝如耳，如泣如诉。 ]],
musics={ "",  },musicEffect="",},

{id=17.0,name="西夏",pic="地图.西夏",desc=[[ 你在西夏城门口与一对铁甲士兵擦肩而过，西夏与北宋战事连绵不绝，加之近日，西夏银川公主近日招选驸马，前来应选的中原、吐蕃、契丹人众多，整个国家都充满了紧张严肃的气氛。 ]],
musics={ "音乐.武侠回忆",  },musicEffect="",},

{id=18.0,name="西夏酒楼",pic="地图.酒楼",desc=[[ 你来到西夏的一间酒楼，这里稀稀拉拉有几个常年往返于西域和中原的商人。 ]],
musics={ "音乐.武侠回忆",  },musicEffect="",},

{id=19.0,name="少林寺",pic="地图.少林",desc=[[ 你拾级而上来到天下名刹少林寺，历经数百年战火屹立不倒的少林是中原武林正派的泰山北斗，少林的历代高僧均是佛学、武学兼修，数百余年下来少林武学积淀极为深厚，令江湖中人垂涎不已。 ]],
musics={ "音乐.天龙八部.佛音1", "音乐.天龙八部.佛音2",  },musicEffect="",},

{id=20.0,name="佛山镇",pic="地图.佛山镇",desc=[[ 你来到珠江边的佛山小镇，此处远离中原，气候湿热，风土人情较中原极为不同。几个矮瘦的当地人正坐在一起吸食鸦片，完全不理会你的到来。 ]],
musics={ "音乐.欢快工作",  },musicEffect="",},

{id=21.0,name="湘妃庙",pic="地图.湘妃庙",desc=[[ 这里是供奉娥皇、女英的湘妃庙，因连日阴雨，屋顶上有几处已经开始漏雨，瓦片也有些松动了。 ]],
musics={ "",  },musicEffect="",},

{id=22.0,name="苗人凤居",pic="地图.小村口",desc=[[ 眼前是一处简陋的住宅，然而却显得十分干净整洁，屋前的空地上金面佛苗人凤正在练剑。 ]],
musics={ "音乐.天龙八部.紧张感5",  },musicEffect="",},

{id=23.0,name="药王庄",pic="地图.小村口",desc=[[ 你沿着衡阳城外密密的古林一路走来，到这里道路变得忽然开阔起来。道路尽头一座小小的庄园掩映在参天的古木之下。
进入药王庄需要佩戴蓝花已经成了公开的秘密，你在庄外的树林间摘到一株蓝花走进了这座小庄园。 ]],
musics={ "音乐.天外村",  },musicEffect="",},

{id=24.0,name="藏经阁",pic="地图.藏经阁",desc=[[ 这里是少林寺收藏佛家典籍、武功秘籍之处，一直以来为江湖人士觊觎。然而此刻的藏经阁异常静谧，感受不到一丝一毫紧张的气息。 ]],
musics={ "音乐.天龙八部.佛音4",  },musicEffect="",},

{id=25.0,name="江陵",pic="地图.江陵",desc=[[ 你来到楚国古都水乡江陵，此处位于江汉平原之上，江湖纵横交错，盛产莲藕。从这里可以乘坐渡船前往长江南岸。 ]],
musics={ "音乐.天龙八部.佛音3",  },musicEffect="",},

{id=26.0,name="天宁寺",pic="地图.天宁寺",desc=[[ 这是一座江陵城内的寺庙，因长江商业繁华，天宁寺香火鼎盛，来往香客不绝如缕。 ]],
musics={ "音乐.天龙八部.佛音3",  },musicEffect="",},

{id=27.0,name="霹雳堂",pic="地图.霹雳堂",desc=[[ 你来到一个奇异的空间，这里的空气中带着硫磺的味道，充满了杀伐的气息。 ]],
musics={ "音乐.武林至尊",  },musicEffect="",},

{id=28.0,name="侠客岛",pic="地图.侠客岛",desc=[[ 你随着张三、李四乘船，从东海边出发，经过了数天的海上漂泊来到了这个世外小岛。码头的前方立着一块偌大的石碑，上书“侠客岛”三字苍劲有力。两位老者正在码头前迎接你们，两人须发皆白，浑身上下透出一股雄浑的气势。 ]],
musics={ "音乐.天龙八部.逍遥派",  },musicEffect="",},

{id=29.0,name="侠客岛洞内",pic="地图.侠客岛洞内",desc=[[ 你在岛中随意走动，来到这个洞穴之中。众多中原武林的知名人士均聚集于此，对着各处石壁冥思苦想。你凑上前去一看，原来石壁之上以苍劲的笔法题诗一首，“赵客缦胡缨，吴钩霜雪明…”，原来是李白所作的《侠客行》。
石壁字刻透着不同寻常的气劲，众多武林人士在此参详十余年亦不得其解。在洞中光线昏暗的一角，一个衣衫褴褛的懵懂青年正在轻轻比划些什么。 ]],
musics={ "音乐.天龙八部.逍遥派",  },musicEffect="",},

{id=30.0,name="南贤居死胡同",pic="地图.主角之家",desc=[[ 一个死胡同 ]],
musics={ "",  },musicEffect="",},

{id=31.0,name="武道大会",pic="地图.比武场",desc=[[ 你来到一个大型的比武场地，四周林立着刀枪剑戟。 ]],
musics={ "音乐.金庸群侠传5",  },musicEffect="",},

{id=32.0,name="门派古墓",pic="地图.古墓派",desc=[[ 你正位于古墓派大厅，此处四面皆为石壁，没有任何装潢雕饰，仅有数根蜡烛照亮房间，由此处可以前往古墓派中几处弟子练功的场所。 ]],
musics={ "音乐.神雕.舒缓",  },musicEffect="",},

{id=33.0,name="古墓侧室",pic="地图.古墓玉蜂之间",desc=[[ 黑漆漆的古墓内房间，除了石头还是石头。 ]],
musics={ "音乐.神雕.舒缓",  },musicEffect="",},

{id=34.0,name="古墓走廊",pic="地图.古墓走廊",desc=[[ 黑漆漆的古墓走廊，在这里行走久了能练成黑暗视物的本领。 ]],
musics={ "音乐.神雕.舒缓",  },musicEffect="",},

{id=35.0,name="杨冰儿房间",pic="地图.古墓绳床之间",desc=[[ 你行至此处房间，虽然仍是四面石壁，空空如也，空气之中却多了一股沁人心脾的幽香。房间一角是一张简陋的石床，另一角则是一张石桌，几个用来保存玉峰浆的白瓷瓶整齐地摆放在桌上。一袭白衣挂在床尾的墙上。 ]],
musics={ "音乐.室内_安静",  },musicEffect="",},

{id=36.0,name="门派大轮寺",pic="地图.大轮寺正殿",desc=[[ 你沿着雪山的小径来到了大轮寺，雪后大轮寺的金顶在阳光的映照下愈发耀眼。几个新入寺修行的喇嘛正在院中扫雪，不惧风雪前来上香的信众正在金顶下集合参拜。 ]],
musics={ "音乐.天龙八部.佛音4",  },musicEffect="",},

{id=37.0,name="大轮寺雪山",pic="地图.大轮寺雪山",desc=[[ 大轮寺附近的雪山，白雪皑皑。 ]],
musics={ "音乐.天龙八部.佛音4",  },musicEffect="",},

{id=38.0,name="大轮寺雪谷",pic="地图.大轮寺雪谷1",desc=[[ 大轮寺附近的山谷，两边山崖高耸，谷底积满了厚厚的白雪。 ]],
musics={ "音乐.天龙八部.佛音4",  },musicEffect="",},

{id=39.0,name="大轮寺雪谷深处",pic="地图.大轮寺雪谷2",desc=[[ 雪谷深处，积满了厚厚的白雪。 ]],
musics={ "音乐.天龙八部.佛音4",  },musicEffect="",},

{id=40.0,name="血刀门",pic="地图.血刀门",desc=[[ 你的眼前是沸腾翻滚的血池，空气中充满了灼烧的味道。几个血刀门弟子正在不怀好意地盯着你，仿佛随时准备从后方向你袭来。 ]],
musics={ "音乐.血刀门",  },musicEffect="",},

{id=41.0,name="全真教",pic="地图.全真教",desc=[[ 你的眼前是天下玄门正宗的终南山全真教大院，全真教地处天子身侧，备受恩宠，引领天下道家玄门。
长安达官贵人众多，全真教因此香火鼎盛，整个教观气势宏大，独具一格。天一、太一、华清等阁楼鳞次栉比，宛如天上宫阙。 ]],
musics={ "音乐.全真教",  },musicEffect="",},

{id=42.0,name="灵鹫宫",pic="地图.灵鹫宫",desc=[[ 你施展轻功沿着险峻的天山一路向上，灵鹫宫正坐落于天山之巅。此处虽地处西域，然而建筑、装饰与中土无异。灵鹫宫前终年云雾缭绕，凡人至此，仿佛置身缥缈仙境，忘却凡尘种种。 ]],
musics={ "音乐.天外村",  },musicEffect="",},

{id=43.0,name="少林寺内",pic="地图.少林寺内",desc=[[ 此刻的少林寺中一片宁静，矮墙之外松涛阵阵，大殿之中木鱼声声，一阵若有若无的檀香飘过，沁人心脾。 ]],
musics={ "音乐.少林山门",  },musicEffect="",},

{id=44.0,name="少林后山",pic="地图.少林后山",desc=[[ 这里是少林寺后山，通往塔林和山顶。 ]],
musics={ "",  },musicEffect="",},

{id=45.0,name="南少林",pic="地图.南少林",desc=[[ 你来到一座朴实无华的寺院，虽地处闽南，但此处建筑、装饰与中原并无二致。僧人们各自忙碌，似乎没有人多看你第二眼。南来北往的香客操着你听不懂的闽南方言，让你颇有些怅惘的感觉。 ]],
musics={ "",  },musicEffect="",},

{id=46.0,name="昆仑派",pic="地图.昆仑派",desc=[[ 这里是昆仑派。 ]],
musics={ "音乐.天外村",  },musicEffect="",},

{id=47.0,name="武当广场",pic="地图.武当广场",desc=[[ 这里是武当派的门户，龟蛇二兽镇守山门，再往上就是武当派的斗拱接连的殿宇了。 ]],
musics={ "音乐.武当",  },musicEffect="",},

{id=48.0,name="三清殿",pic="地图.三清殿",desc=[[ 武当派聚集议事的大殿，高手云集。 ]],
musics={ "音乐.武当",  },musicEffect="",},

{id=49.0,name="后山练功场",pic="地图.武当后山",desc=[[ 武当派开阔的广场，众多武当弟子在这里比划拆招，一副大派气象。 ]],
musics={ "",  },musicEffect="",},

{id=50.0,name="大理",pic="地图.大理",desc=[[ 你来到南疆大理，虽远在天南，大理却依然奉行中土文化。天南段氏统治大理百年，以武立国，以德治国，维持着这个南疆小国来之不易的和平气象。 ]],
musics={ "音乐.城市4",  },musicEffect="",},

{id=51.0,name="镇南王府",pic="地图.府门前",desc=[[ 这里是大理镇南王府，极尽人间之奢华。 ]],
musics={ "音乐.城市4",  },musicEffect="",},

{id=52.0,name="大理树林",pic="地图.树林",desc=[[ 你来到一片树林之中，此地接近大理，偶尔有大理人氏走动。 ]],
musics={ "音乐.天龙八部8",  },musicEffect="",},

{id=53.0,name="无量山洞",pic="地图.无量山洞",desc=[[ 你在无量山中行走，忽然发现此处密洞。密洞外水帘之间剑影闪动，密洞内有一白玉雕成的美人玉像，容貌之美世间罕有。仔细观察四周，墙上还留有“洞中无日月，人间至乐也”几个题字。 ]],
musics={ "音乐.天龙八部.无量山洞",  },musicEffect="",},

{id=54.0,name="无量秘洞",pic="地图.密洞",desc=[[ 这是无量玉洞内的一处隐秘洞穴，想必是旧日高人前辈埋藏秘宝之所。 ]],
musics={ "音乐.天龙八部.无量山洞",  },musicEffect="",},

{id=55.0,name="万劫谷",pic="地图.村口2",desc=[[ 你来到一座千奇百怪的山谷前，此山谷怪石崚峋，远远望去仿佛一个愁眉苦脸的人脸模样。 ]],
musics={ "音乐.天龙八部8",  },musicEffect="",},

{id=56.0,name="五毒教山中1",pic="地图.山间小路1",desc=[[ 你走在南疆的一条山路上，不知通往何方。 ]],
musics={ "音乐.城市4",  },musicEffect="",},

{id=57.0,name="五毒教山中2",pic="地图.山间小路2",desc=[[ 你走在南疆的一条山路上，不知通往何方。 ]],
musics={ "音乐.城市4",  },musicEffect="",},

{id=58.0,name="五毒教山中3",pic="地图.山间小路1",desc=[[ 你走在南疆的一条山路上，不知通往何方。 ]],
musics={ "音乐.城市4",  },musicEffect="",},

{id=59.0,name="五毒教山中4",pic="地图.山间小路2",desc=[[ 你走在南疆的一条山路上，不知通往何方。 ]],
musics={ "音乐.城市4",  },musicEffect="",},

{id=60.0,name="五毒教",pic="地图.五毒教",desc=[[ 你眼前忽然一亮，原来前方就是南疆五毒教所在地。五毒教众均为年轻貌美的女子，衣着暴露。此刻几位不知名的教众正看着你微笑，媚眼如波。 ]],
musics={ "音乐.城市4",  },musicEffect="",},

{id=61.0,name="五毒教森林1",pic="地图.森林1",desc=[[ 你行走在五毒教深处的森林中，仿佛能听到毒蛇的嘶嘶声，令人不寒而栗。 ]],
musics={ "音乐.城市4",  },musicEffect="",},

{id=62.0,name="五毒教森林2",pic="地图.森林2",desc=[[ 你行走在五毒教深处的森林中，仿佛能听到毒蛇的嘶嘶声，令人不寒而栗。 ]],
musics={ "音乐.城市4",  },musicEffect="",},

{id=63.0,name="五毒教森林3",pic="地图.森林1",desc=[[ 你行走在五毒教深处的森林中，仿佛能听到毒蛇的嘶嘶声，令人不寒而栗。 ]],
musics={ "音乐.城市4",  },musicEffect="",},

{id=64.0,name="五毒教森林4",pic="地图.森林2",desc=[[ 你行走在五毒教深处的森林中，仿佛能听到毒蛇的嘶嘶声，令人不寒而栗。 ]],
musics={ "音乐.城市4",  },musicEffect="",},

{id=65.0,name="金蛇窟",pic="地图.华山山洞",desc=[[ 你来到五毒教深处的一个密洞之中，此地瘴气很重，你只能暗运内功使真气在体内流转，尽量减少呼吸。 ]],
musics={ "音乐.天龙八部.忧伤",  },musicEffect="",},

{id=66.0,name="勃泥岛",pic="地图.树林",desc=[[ 你在东海航行数日，来到这个小岛。岛上有一座小竹屋，看来有人在此长居。 ]],
musics={ "音乐.天龙八部1",  },musicEffect="",},

{id=67.0,name="华山",pic="地图.华山",desc=[[ 你的眼前是陡峭险峻的西岳华山，如同一把刀锋一般直插入云霄。险峰之间，一条细细的小道蜿蜒。五岳剑派之中的华山派正位于此地。 ]],
musics={ "音乐.武侠雄壮",  },musicEffect="",},

{id=68.0,name="华山派",pic="地图.帮派门前",desc=[[ 你来到华山派山门前，附近没有见到几个华山弟子。 ]],
musics={ "音乐.武侠雄壮",  },musicEffect="",},

{id=69.0,name="华山后山1",pic="地图.山间小路1",desc=[[ 你行走在华山之中，云雾缭绕，地势险峻。 ]],
musics={ "音乐.武侠雄壮",  },musicEffect="",},

{id=70.0,name="华山后山2",pic="地图.山间小路2",desc=[[ 你行走在华山之中，云雾缭绕，地势险峻。 ]],
musics={ "音乐.武侠雄壮",  },musicEffect="",},

{id=71.0,name="华山后山3",pic="地图.山间小路1",desc=[[ 你行走在华山之中，云雾缭绕，地势险峻。 ]],
musics={ "音乐.武侠雄壮",  },musicEffect="",},

{id=72.0,name="华山后山4",pic="地图.山间小路2",desc=[[ 你行走在华山之中，云雾缭绕，地势险峻。 ]],
musics={ "音乐.武侠雄壮",  },musicEffect="",},

{id=73.0,name="华山后山",pic="地图.华山后山",desc=[[ 你好不容易爬上华山后山，回望来时的路，已经在云雾之中再也看不真切。此处地势忽然开阔，树林石缝之间不知名的野花丛生，不复山间险峻的情形。 ]],
musics={ "音乐.武侠雄壮",  },musicEffect="",},

{id=74.0,name="华山山洞",pic="地图.华山山洞",desc=[[ 你弯身走进华山后山的一个山洞中，原来此处别有洞天，内部空间极为开阔。 ]],
musics={ "音乐.武侠雄壮",  },musicEffect="",},

{id=75.0,name="华山仙境",pic="地图.黑木崖下",desc=[[ 你眼前一晃，华山原来还有这么一处风景极佳、人迹罕至的秘境。 ]],
musics={ "音乐.武侠回忆",  },musicEffect="",},

{id=76.0,name="嵩山",pic="地图.嵩山",desc=[[ 你的眼前是中岳嵩山，黄土和乱石之上，拔地而起的嵩山青葱翠郁，展现着屹立中原大地的大山气势。 ]],
musics={ "音乐.天龙八部5",  },musicEffect="",},

{id=77.0,name="嵩山派",pic="地图.嵩山派",desc=[[ 你来到嵩山派山门前，几个嵩山弟子正紧张地看着你。 ]],
musics={ "音乐.天龙八部5",  },musicEffect="",},

{id=78.0,name="古墓派",pic="地图.古墓派",desc=[[ 你四处打听终于找到古墓入口，古墓前厅用石头砌成，没有多余的雕饰。在这黑暗的墓穴之中，无法想象古墓弟子可以长期在此生活。 ]],
musics={ "音乐.室内_安静",  },musicEffect="",},

{id=79.0,name="绝情谷",pic="地图.绝情谷",desc=[[ 你在山中几番查探才找了这个隐蔽的山谷，谷中楼宇接连，均采用了唐朝的旧式样，你沿着谷中方位走进绝情谷的大殿之中。 ]],
musics={ "音乐.神雕.舒缓",  },musicEffect="",},

{id=80.0,name="程英居",pic="地图.小村口",desc=[[ 你来到一个安静的小屋前，院子里种着一些不知名的小花，屋子里还摆着一些做衣服用的针线、布料。 ]],
musics={ "音乐.神雕.歌泣",  },musicEffect="",},

{id=81.0,name="风陵渡口",pic="地图.风陵渡口",desc=[[ 你来到一个热闹喧哗的黄河渡口，这里河水流速相对平缓，因此排队过河的人很多。附近的酒楼、客栈也因此生意兴隆。 ]],
musics={ "音乐.神雕.歌泣",  },musicEffect="",},

{id=82.0,name="剑魔荒冢",pic="地图.剑魔荒冢",desc=[[ 你来到大山之中的一处旷地，旷地中央是一个没有墓碑的荒冢，一把巨剑从上往下直插过荒冢。苍穹之上，电闪雷鸣，无敌于江湖的求败传奇埋骨于此。 ]],
musics={ "音乐.神雕.主题",  },musicEffect="",},

{id=83.0,name="南贤居",pic="地图.主角之家",desc=[[ 你回到了南贤居，南贤还是保持着你离开时的模样，正摇头晃脑地看着一本书，口里念念有词。 ]],
musics={ "音乐.室内_清新",  },musicEffect="",},

{id=84.0,name="白驼山庄",pic="地图.帮派大厅",desc=[[ 你进入了白驼山庄，此处为西毒欧阳锋居所，所饲养毒物众多。欧阳锋侄儿欧阳克喜好女色，白驼山庄中身着暴露的美女众多，几个庄丁在远处警惕地盯着你。 ]],
musics={ "音乐.神雕.舒缓",  },musicEffect="",},

{id=85.0,name="桃花岛",pic="地图.桃花岛",desc=[[ 你好不容易说服东海渔夫带你踏上桃花岛，岛上处处桃花盛开，美不胜收，却又暗合阴阳五行，杀机四伏。 ]],
musics={ "音乐.神雕.歌泣",  },musicEffect="",},

{id=86.0,name="武当派",pic="地图.武当山门",desc=[[ 你随着上山的众多香客一起来到了武当山顶。武当地处中原南北分野，云气纵横，气象万千。开派宗师张三丰在此悟出太极圆通之道，以柔克刚，成就武当数百年的威名。 ]],
musics={ "音乐.武当",  },musicEffect="",},

{id=87.0,name="真武殿",pic="地图.三清殿",desc=[[ 你来到武当派真武殿，此处是武当张真人会客之所，早有小童迎接你入内，并奉上差点。 ]],
musics={ "音乐.天龙八部4",  },musicEffect="",},

{id=88.0,name="昆仑山",pic="地图.昆仑山",desc=[[ 你踏上了巍峨壮丽的西北屋脊，延绵千里的昆仑雪山留下了无数的神话传说，令中原远道之客充满了无尽的遐想。晴雪之际，天空湛蓝，玉龙苍莽，仿佛置身天外。 ]],
musics={ "音乐.天龙八部5",  },musicEffect="",},

{id=89.0,name="昆仑山山洞1",pic="地图.山洞1",desc=[[ 你来到昆仑山中的一个山洞，外面风很大，正好在这里避避风，暖和一下。 ]],
musics={ "音乐.神秘山洞",  },musicEffect="",},

{id=90.0,name="昆仑山山洞2",pic="地图.山洞2",desc=[[ 你来到昆仑山中的一个山洞，外面风很大，正好在这里避避风，暖和一下。 ]],
musics={ "音乐.神秘山洞",  },musicEffect="",},

{id=91.0,name="昆仑山山洞3",pic="地图.山洞3",desc=[[ 你来到昆仑山中的一个山洞，外面风很大，正好在这里避避风，暖和一下。 ]],
musics={ "音乐.神秘山洞",  },musicEffect="",},

{id=92.0,name="昆仑山山洞4",pic="地图.山洞1",desc=[[ 你来到昆仑山中的一个山洞，外面风很大，正好在这里避避风，暖和一下。 ]],
musics={ "音乐.神秘山洞",  },musicEffect="",},

{id=93.0,name="昆仑山天池",pic="地图.天池",desc=[[ 你的眼前是昆仑山中的一个湖泊，如同宝石一般镶嵌在大山之中，璀璨流霞。 ]],
musics={ "音乐.天龙八部.逍遥派",  },musicEffect="",},

{id=94.0,name="昆仑山之巅",pic="地图.昆仑山之巅",desc=[[ 你来到了昆仑山之巅，由此处回望中原，山峰林立，绵延千里，渺渺乎不知其所踪。 ]],
musics={ "音乐.天龙八部.逍遥派",  },musicEffect="",},

{id=95.0,name="昆仑山山路1",pic="地图.雪山山路1",desc=[[ 你行走在昆仑山中，风刮起雪花打在你的脸上。 ]],
musics={ "音乐.天龙八部5",  },musicEffect="",},

{id=96.0,name="昆仑山山路2",pic="地图.雪山山路2",desc=[[ 你行走在昆仑山中，风刮起雪花打在你的脸上。 ]],
musics={ "音乐.天龙八部5",  },musicEffect="",},

{id=97.0,name="昆仑山山路3",pic="地图.雪山山路3",desc=[[ 你行走在昆仑山中，风刮起雪花打在你的脸上。 ]],
musics={ "音乐.天龙八部5",  },musicEffect="",},

{id=98.0,name="昆仑山山路4",pic="地图.雪山山路1",desc=[[ 你行走在昆仑山中，风刮起雪花打在你的脸上。 ]],
musics={ "音乐.天龙八部5",  },musicEffect="",},

{id=99.0,name="昆仑山山路5",pic="地图.雪山山路2",desc=[[ 你行走在昆仑山中，风刮起雪花打在你的脸上。 ]],
musics={ "音乐.天龙八部5",  },musicEffect="",},

{id=100.0,name="昆仑山山路6",pic="地图.雪山山路1",desc=[[ 你行走在昆仑山中，风刮起雪花打在你的脸上。 ]],
musics={ "音乐.天龙八部5",  },musicEffect="",},

{id=101.0,name="峨眉山中1",pic="地图.山间小路1",desc=[[ 你行走在峨眉山中，偶尔一、两只猴子在树上向你做鬼脸。 ]],
musics={ "音乐.天龙八部6",  },musicEffect="",},

{id=102.0,name="峨眉山中2",pic="地图.山间小路2",desc=[[ 你行走在峨眉山中，偶尔一、两只猴子在树上向你做鬼脸。 ]],
musics={ "音乐.天龙八部6",  },musicEffect="",},

{id=103.0,name="峨眉山中3",pic="地图.山间小路1",desc=[[ 你行走在峨眉山中，偶尔一、两只猴子在树上向你做鬼脸。 ]],
musics={ "音乐.天龙八部6",  },musicEffect="",},

{id=104.0,name="峨眉山中4",pic="地图.山间小路2",desc=[[ 你行走在峨眉山中，偶尔一、两只猴子在树上向你做鬼脸。 ]],
musics={ "音乐.天龙八部6",  },musicEffect="",},

{id=105.0,name="峨眉金顶",pic="地图.华山",desc=[[ 你来到了峨眉山之巅，此处望日出云海，金碧辉煌。 ]],
musics={ "音乐.武侠回忆",  },musicEffect="",},

{id=106.0,name="恒山山顶",pic="地图.恒山",desc=[[ 你来到恒山山顶，望山中一片苍翠。 ]],
musics={ "音乐.武侠回忆",  },musicEffect="",},

{id=107.0,name="襄阳",pic="地图.襄阳",desc=[[ 你来到了战火纷飞的襄阳城，大宋与蒙古在此交战多年，襄阳城已经残破不堪，然而从各地赶来增援的义军源源不断，这座扼守通往大宋腹地道路的要塞承担着极其重要的历史使命。
你所见之处均为破败的民居，飞尘漫天，不复旧日辉煌的气象。 ]],
musics={ "音乐.紧张感",  },musicEffect="",},

{id=108.0,name="杭州",pic="地图.杭州",desc=[[ 上有天堂、下有苏杭，你走在杭州西湖边，苏堤、白堤静卧在山水之间。望着水云接天的美景，心情舒畅。往来游人如织，叫卖之声不绝于耳，偶尔一声撞钟之声自南而来，那就是净慈寺著名的南屏晚钟了。 ]],
musics={ "音乐.天龙八部2",  },musicEffect="",},

{id=109.0,name="杭州酒楼",pic="地图.酒楼",desc=[[ 你登上西湖边的一座酒楼，人声鼎沸。你高喊一声“小二”！不一会儿肩上搭着毛巾的店小二就唱着喏给你添上了茶水。 ]],
musics={ "音乐.天龙八部2",  },musicEffect="",},

{id=110.0,name="六和塔",pic="地图.六和塔",desc=[[ 你来到杭州六和塔前，此处有众多官兵把守，戒备森严。 ]],
musics={ "音乐.城市2",  },musicEffect="",},

{id=111.0,name="梅庄",pic="地图.梅庄",desc=[[ 你离开西湖边的热闹的人群，几个转身，来到这处幽深僻静的西湖梅庄。 ]],
musics={ "音乐.天龙八部.逍遥派抒情版",  },musicEffect="",},

{id=112.0,name="西湖底",pic="地图.地牢",desc=[[ 你走进西湖梅庄的地下牢房，此处常年不见天日，空气中有一股潮湿腐烂的味道。 ]],
musics={ "音乐.天龙八部.逍遥派抒情版",  },musicEffect="",},

{id=113.0,name="黑木崖下",pic="地图.黑木崖下",desc=[[ 你来到了一个陡峭的悬崖边，根据南贤传授的日月教暗号尖声长啸，不一会儿就有人用竹篓将你运上了黑木崖。 ]],
musics={ "音乐.天龙八部8",  },musicEffect="",},

{id=114.0,name="黑木崖小路1",pic="地图.山间小路1",desc=[[ 你行走在黑木崖的山中，寻找前往日月教的路。 ]],
musics={ "音乐.天龙八部8",  },musicEffect="",},

{id=115.0,name="黑木崖小路2",pic="地图.山间小路2",desc=[[ 你行走在黑木崖的山中，寻找前往日月教的路。 ]],
musics={ "音乐.天龙八部8",  },musicEffect="",},

{id=116.0,name="黑木崖小路3",pic="地图.山间小路1",desc=[[ 你行走在黑木崖的山中，寻找前往日月教的路。 ]],
musics={ "音乐.天龙八部8",  },musicEffect="",},

{id=117.0,name="黑木崖小路4",pic="地图.山间小路2",desc=[[ 你行走在黑木崖的山中，寻找前往日月教的路。 ]],
musics={ "音乐.天龙八部8",  },musicEffect="",},

{id=118.0,name="黑木崖",pic="地图.黑木崖",desc=[[ 你来到了日月教总坛，一些低阶级的教众正在四处忙碌些什么。 ]],
musics={ "音乐.紧张感",  },musicEffect="",},

{id=119.0,name="黑木崖密洞",pic="地图.华山山洞",desc=[[ 这里是黑木崖上的一个密洞，人迹罕至。 ]],
musics={ "音乐.武侠雄壮",  },musicEffect="",},

{id=120.0,name="湘江",pic="地图.湘江",desc=[[ 你眼前忽然开阔起来，原来你来到了湘江边上。江流婉转，汇入洞庭湖，几艘渔船正在江上捕鱼。 ]],
musics={ "音乐.武侠流水",  },musicEffect="",},

{id=121.0,name="桃花源",pic="地图.桃花源",desc=[[ 你来到了一个密林中的村落，此处桃花盛开，仙气飘飘，仿佛身处桃源梦境。 ]],
musics={ "音乐.天外村",  },musicEffect="",},

{id=122.0,name="衡山派",pic="地图.帮派门前",desc=[[ 你来到了衡山派山门前，一阵悠扬的胡琴声在四处飘荡。 ]],
musics={ "音乐.武侠流水",  },musicEffect="",},

{id=123.0,name="唐诗山洞",pic="地图.洞穴1",desc=[[ 你在密林中四处搜寻，找到了这个山洞。山洞中尚有燃烧未尽的篝火，一些日用的坛坛罐罐散落在四处，显然这里一直有人居住。 ]],
musics={ "音乐.天龙八部.忧伤",  },musicEffect="",},

{id=124.0,name="衡阳郊外",pic="地图.郊外",desc=[[ 你来到衡阳郊外的一处旷地，远处有一些村落和炊烟。 ]],
musics={ "音乐.天龙八部.忧伤",  },musicEffect="",},

{id=125.0,name="潇湘古林1",pic="地图.森林1",desc=[[ 你行走在潇湘的密林之中，到处是鸟鸣虫唱，古木遮天，你也不知道自己要去哪里。 ]],
musics={ "音乐.武侠流水",  },musicEffect="",},

{id=126.0,name="潇湘古林2",pic="地图.森林2",desc=[[ 你行走在潇湘的密林之中，到处是鸟鸣虫唱，古木遮天，你也不知道自己要去哪里。 ]],
musics={ "音乐.武侠流水",  },musicEffect="",},

{id=127.0,name="潇湘古林3",pic="地图.森林3",desc=[[ 你行走在潇湘的密林之中，到处是鸟鸣虫唱，古木遮天，你也不知道自己要去哪里。 ]],
musics={ "音乐.武侠流水",  },musicEffect="",},

{id=128.0,name="潇湘古林4",pic="地图.森林1",desc=[[ 你行走在潇湘的密林之中，到处是鸟鸣虫唱，古木遮天，你也不知道自己要去哪里。 ]],
musics={ "音乐.武侠流水",  },musicEffect="",},

{id=129.0,name="潇湘古林5",pic="地图.森林2",desc=[[ 你行走在潇湘的密林之中，到处是鸟鸣虫唱，古木遮天，你也不知道自己要去哪里。 ]],
musics={ "音乐.武侠流水",  },musicEffect="",},

{id=130.0,name="潇湘古林6",pic="地图.森林1",desc=[[ 你行走在潇湘的密林之中，到处是鸟鸣虫唱，古木遮天，你也不知道自己要去哪里。 ]],
musics={ "音乐.武侠流水",  },musicEffect="",},

{id=131.0,name="哈萨克部落",pic="地图.塞外",desc=[[ 你眼前是哈萨克牧民的部落，几个游牧民正喝着奶聊着天。 ]],
musics={ "音乐.太行八径",  },musicEffect="",},

{id=132.0,name="高昌迷宫",pic="地图.沙漠",desc=[[ 你在沙漠中左寻右找，居然发现了传说中的高昌迷宫。昔日恢弘的宫殿埋藏在砂砾之中，风沙吹拂，道不尽的苍凉。 ]],
musics={ "音乐.宿命",  },musicEffect="",},

{id=133.0,name="回族部落",pic="地图.塞外",desc=[[ 你来到河西走廊的一处回民部落，感受到浓郁的异域风情。 ]],
musics={ "音乐.太行八径",  },musicEffect="",},

{id=134.0,name="同福客栈",pic="地图.客栈",desc=[[ 你来到一个看似普通的客栈，可是早有很多人告诉你这里个个都是奇葩。 ]],
musics={ "音乐.欢快工作",  },musicEffect="",},

{id=135.0,name="北京",pic="地图.长安",desc=[[ 你随着进城的人流一起涌入了北京城，穿过前门大街行走在紫禁城下。此处戒备森严，游人稀少，早起的八旗子弟相约前往后海养鸟。 ]],
musics={ "音乐.城市3",  },musicEffect="",},

{id=136.0,name="丐帮",pic="地图.丐帮",desc=[[ 你来到了树林中一处旷地，远远望去许多丐帮弟子衣衫褴褛、席地而坐。丐帮弟子均手持竹棒，身上挂满了大小不一的各式布袋。几个放哨巡逻的弟子带着警惕的眼光注视着你。 ]],
musics={ "音乐.天龙八部1", "音乐.天龙八部2", "音乐.天龙八部3", "音乐.天龙八部4",  },musicEffect="",},

{id=137.0,name="雁门关",pic="地图.雁门关",desc=[[ 你来到通往塞外的雁门关前，怪石嶙峋，北风苍劲。由于边境战事连连，已经很少有人愿意靠近这里了。 ]],
musics={ "音乐.武林至尊",  },musicEffect="",},

{id=138.0,name="擂鼓山",pic="地图.擂鼓山",desc=[[ 你来到聪辩先生苏星河所在的擂鼓山，一直以来都有不少武林人士来此挑战珍珑棋局。 ]],
musics={ "音乐.天龙八部.逍遥派",  },musicEffect="",},

{id=139.0,name="黑龙潭",pic="地图.树林",desc=[[ 你施展轻功飘过黑龙潭泥沼，一脸憨笑的周伯通早在瑛姑的屋前等着你。 ]],
musics={ "音乐.天龙八部5",  },musicEffect="",},

{id=140.0,name="香格里拉",pic="地图.香格里拉",desc=[[ 你来到川南的一处人间仙境，此处风景如诗如画，充满了浓郁的康巴风情。 ]],
musics={ "音乐.天龙八部.无量山洞",  },musicEffect="",},

{id=141.0,name="松鼠旅馆",pic="地图.松鼠旅馆",desc=[[ 你来到一处如诗如画的仙境，却发现汉家松鼠童鞋已经捷足先登，盖了一间破破的客栈。 ]],
musics={ "音乐.天龙八部.无量山洞",  },musicEffect="",},

{id=142.0,name="石梁派",pic="地图.青城派",desc=[[ 你沿着小路来到石梁派，这里是温家五老大本营。 ]],
musics={ "音乐.神雕.舒缓",  },musicEffect="",},

{id=143.0,name="石梁派大殿",pic="地图.帮派大厅",desc=[[ 你来到石梁派大殿之中，此处装饰精美，充满了江南精致的情调。 ]],
musics={ "音乐.神雕.舒缓",  },musicEffect="",},

{id=144.0,name="天安门",pic="地图.大帐",desc=[[ 你来到天安门前，金水河边有几个巡逻的禁军卫士。 ]],
musics={ "音乐.城市3",  },musicEffect="",},

{id=145.0,name="公主寝宫",pic="地图.寝宫",desc=[[ 你施展轻功进入紫禁城，绕开禁军卫士来到公主寝宫。此处装饰富丽堂皇，摆满了各式首饰。 ]],
musics={ "音乐.神雕.舒缓",  },musicEffect="",},

{id=146.0,name="小村",pic="地图.小村",desc=[[ 你走出南贤屋外，看了一眼这个简陋的新手村…还是赶紧想办法离开这里吧。 ]],
musics={ "音乐.室内_清新",  },musicEffect="",},

{id=147.0,name="南贤屋内",pic="地图.农舍内",desc=[[ 你身处一间简陋的农家院内，南贤正在一边沉思着些什么。 ]],
musics={ "音乐.室内_清新",  },musicEffect="",},

{id=148.0,name="破庙",pic="地图.破庙",desc=[[ 你来到了一间破庙，因为人迹罕至，佛像已经很久无人打扫，挂满了蜘蛛网和灰尘。 ]],
musics={ "音乐.天龙八部.佛音1",  },musicEffect="",},

{id=149.0,name="长安一梦",pic="地图.塞外",desc=[[ 你的眼前是一片开阔的草原，天苍苍，野茫茫。数十个牧民的帐篷围在一起，几名身着牧民服饰的女人正在修补羊圈，这里就是仙丽雅的部落了。 ]],
musics={ "音乐.天外村",  },musicEffect="",},

{id=150.0,name="长安一梦草场",pic="地图.草场",desc=[[ 你来到部落放牧的草场，几个牧民正赶着羊群吃草，有人愉快地唱着歌。 ]],
musics={ "",  },musicEffect="",},

{id=151.0,name="长安一梦溪边",pic="地图.郊野",desc=[[ 你来到一条小溪边，溪水潺潺，这里是部落取水的地方。 ]],
musics={ "",  },musicEffect="",},

{id=152.0,name="长安一梦树林",pic="地图.树林",desc=[[ 你来到树林里，这里树木虽然不比深山老林郁郁葱葱，但在草原之中亦是难得。 ]],
musics={ "",  },musicEffect="",},

{id=153.0,name="长安一梦山洞",pic="地图.昆仑山底",desc=[[ 你行走在山洞里，阴风阵阵。 ]],
musics={ "音乐.紧张感",  },musicEffect="",},

{id=154.0,name="长安一梦山洞2",pic="地图.华山山洞",desc=[[ 你行走在山洞里，阴风阵阵。 ]],
musics={ "音乐.紧张感",  },musicEffect="",},

{id=155.0,name="长安一梦山洞3",pic="地图.昆仑山底",desc=[[ 你行走在山洞里，阴风阵阵。 ]],
musics={ "音乐.紧张感",  },musicEffect="",},

{id=156.0,name="长安一梦山洞4",pic="地图.密洞",desc=[[ 你行走在山洞里，阴风阵阵。 ]],
musics={ "音乐.紧张感",  },musicEffect="",},

{id=157.0,name="长安一梦幽梦影",pic="地图.古墓派",desc=[[ 你忽然眼前一花，来到一个缥缈虚无的幻境之中。这里景色清幽，仿佛梦回中原。 ]],
musics={ "音乐.天外村",  },musicEffect="",},

{id=158.0,name="长安一梦山洞深处",pic="地图.枯井底",desc=[[ 你来到山洞深处，这里没有其他的路了。 ]],
musics={ "音乐.天外村",  },musicEffect="",},

{id=159.0,name="星宿派",pic="地图.星宿派",desc=[[ 你走进星宿派，到处彩旗飘飘，几个弟子在练习吹奏法螺。 ]],
musics={ "音乐.天龙八部5",  },musicEffect="",},

{id=160.0,name="黑衣总坛",pic="地图.沙漠",desc=[[ 你正位于大沙漠之中一处隐蔽的场所，此处洞穴众多，仔细一看都能发现人工雕饰的久远痕迹。在平静的沙漠之下，你隐隐约约感觉到不同寻常的压迫感。 ]],
musics={ "音乐.武林至尊",  },musicEffect="",},

{id=161.0,name="汉家松鼠工作室",pic="地图.洞穴1",desc=[[ 你蹑手蹑脚爬进鼠洞，原来里面别有洞天，三两打扮奇特的年轻人正围坐在几个发光的屏幕前，口中念念有词。 ]],
musics={ "音乐.天外村",  },musicEffect="",},

{id=162.0,name="汉家松鼠休息室",pic="地图.古墓绳床之间",desc=[[ 你向鼠洞深处探寻，这里有一间简陋的休息室，除了几根绳子吊在半空中什么也没有…一张床也没有。 ]],
musics={ "音乐.天外村",  },musicEffect="",},
}
return map